app/controllers/carros_controller.rb

  def index
    @carros = Carro.all
---
SELECT "carros".* FROM "carros"

  def create
    @carro = Carro.new(carro_params)

    respond_to do |format|
      if @carro.save
---
INSERT INTO "carros" ("placa", "nom_prop", "id_prop", "fecha_venc_soat", "fecha_venc_tm", "fecha_venc_pe", "fecha_venc_pc", "img_lic_trans", "img_tarj_oper", "img_soat", "img_tm", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

    def set_carro
      @carro = Carro.find(params[:id])
---
SELECT  "carros".* FROM "carros" WHERE "carros"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]