app/controllers/conductorescarros_controller.rb

SELECT "conductorcarros".* FROM "conductorcarros"
---
  def index
    @conductorescarros = Conductorcarro.all

SELECT  "carros".* FROM "carros" WHERE "carros"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_conductcar
    @conductorcarro = Conductorcarro.find(params[:id])